---
layout: default
title: Cisco Switch Vlan설정
parent: Blog
grand_parent: Category
permalink: docs/category/blog/110
child_nav_order: desc
---
# Cisco Switch Vlan설정
<details open markdown="block">
  <summary>
    Table of contents
  </summary>
  {: .no_toc .text-delta .label .label-green }
1. TOC
{:toc}
</details>
---

## 개요

> - Cisco Switch Vlan설정
{: .new }

### Vlan설정

- External Network Vlan
  
```bash
switch# configure terminal
switch(config)# vlan 200
switch(config-vlan)# name Vlan200
switch(config-vlan)# exit
```

- External Network Vlan Settings

```bash
switch(config)# interface range GigabitEthernet1/0/1 - 24
switch(config-if-range)# switchport mode access
switch(config-if-range)# switchport access vlan 200
switch(config-if-range)# exit
```

- External Network Vlan MGMT Port

```bash
switch(config)# interface Vlan200
switch(config-if)# ip address 10.1.1.1 255.255.255.0
switch(config-if)# no shutdown
switch(config-if)# exit
switch(config)# end
switch# write memory
```

- Internal Network Vlan

```bash
switch(config)# vlan 100
switch(config-vlan)# name Vlan100
switch(config-vlan)# exit
```

- Internal Network Vlan Settings

```bash
switch(config)# interface range GigabitEthernet1/0/25 - 48
switch(config-if-range)# switchport mode access
switch(config-if-range)# switchport access vlan 100
switch(config-if-range)# exit
```

- Internal Network Vlan MGMT Port

```bash
switch(config)# interface Vlan100
switch(config-if)# ip address 192.168.1.1 255.255.255.0
switch(config-if)# no shutdown
switch(config-if)# exit
switch(config)# end
switch# write memory
```

> - Switch가 2대 이상일 경우 Trunk 사용
> - 이기종간 Vlan 연결시 802.1Q 프로토콜 Trunk 사용
>  
```bash
switch# configure terminal
switch(config)# interface GigabitEthernet1/0/47
switch(config-if)# switchport mode trunk
switch(config-if)# switchport trunk allowed vlan 200
switch(config)# interface GigabitEthernet1/0/48
switch(config-if)# switchport mode trunk
switch(config-if)# switchport trunk allowed vlan 100
switch(config-if)# end
switch# write memory
```
>
{: .important }
