---
layout: default
title: Cisco Switch SSH 설정
parent: Blog
grand_parent: Category
permalink: docs/category/blog/123
child_nav_order: desc
---
# Cisco Switch SSH 설정
<details open markdown="block">
  <summary>
    Table of contents
  </summary>
  {: .no_toc .text-delta .label .label-green }
1. TOC
{:toc}
</details>
---

## 개요

> - Cisco Switch SSH 설정
{: .new }

### SSH 접근 설정

- Enable Password

```bash
switch# configure terminal
switch(config)# enable algorithm-type scrypt secret cisco
switch(config)# do show running-config | include enable
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta }
  
```bash
enable secret 9 $9$WnArItcQHW/uuEx5WTLbu7PbzGDuv0fSwGKS/
```

</details>
{: .label .label-green }

- Username 생성

```bash
switch(config)# username cisco privilege 15 algorithm-type scrypt secret cisco
switch(config)# do show running-config | include username
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta }
  
```bash
username cisco privilege 15 secret 9 $9$WnArItcQHW/uuEx5WTLbu7PbzGDuv0fSwGKS/
```

</details>
{: .label .label-green }

- 기본 AAA 구성

```bash
switch(config)# aaa new-model
switch(config)# aaa authentication login default local
switch(config)# aaa authentication login console none
switch(config)# aaa authorization exec default local
```

- `10.1.1.0 255.255.255.0` ACL 설정

```bash
switch(config)# access-list 10 permit 10.1.1.0 0.0.0.255
switch(config)# access-list 10 permit host 10.1.1.1
```

- VTY 라인 인터페이스 액세스 설정

```bash
switch(config)# line vty 0 15
switch(config-line)# transport input ssh
switch(config-line)# exec-timeout 5 0
switch(config-line)# access-class 10 in
switch(config-line)# exit
```

- SCP 구성

```bash
switch(config)# ip scp server enable
```

- SSH 버전 2 구성

```bash
switch(config)# ip ssh version 2
switch(config)# ip ssh time-out 120
switch(config)# end
switch# write memory
```

- SSH 구성 및 상태에 대한 정보

```bash
switch# show ip ssh
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta }
  
```bash
SSH Enabled - version 2.0
Authentication methods:publickey,keyboard-interactive,password
Encryption Algorithms:aes128-ctr,aes192-ctr,aes256-ctr,aes128-cbc,3des-cbc,aes192-cbc,aes256-cbc
MAC Algorithms:hmac-sha1,hmac-sha1-96
Authentication timeout: 120 secs; Authentication retries: 3
Minimum expected Diffie Hellman key size : 1024 bits
IOS Keys in SECSH format(ssh-rsa, base64 encoded):
ssh-rsa AAAAA1NzaC9yc6EAAAADAQABAAABAQCw+uBg9r6xmju+tosR7hMRQF5MTs2GCYyrKtBDAHVr
A5td+eFYnZ5C7ATE8DMzVb8xE9bEbz8Y1OK3mBu2Wvn2aknqe1QXfFulJtYQz1fnzGSdm3q4JWTP80Kl
BOWO3RcNrCQBlOI8EsFrnzbSjuI34byjbOVljtzOYFEBFDLDTwlWy8gA/HZqny5dccuAfr8DwMgsX/vM
UfiYrBDKo9kHrlBAUD/B4zCJXF3+IduNwbdBf6v5IaqGGS7C8wiyFhzWLp2ZAqiyQJhVYhYejXEEBlf9
D850ntY0SVIfFxjyi2Jon/I6NCPqLIr8zo2W2c8KT+ZkwgRK3hd/n+jZPnKR
```

</details>
{: .label .label-green }

- SSH 설정 및 상태 정보

```bash
switch# show ssh
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta }
  
```bash
Connection Version Mode Encryption  Hmac         State                 Username
5          2.0     IN   aes128-ctr  hmac-sha1    Session started       cisco
5          2.0     OUT  aes128-ctr  hmac-sha1    Session started       cisco
%No SSHv1 server connections running.
```

</details>
{: .label .label-green }

- 로그인한 사용자 정보

```bash
switch# show users
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta }
  
```bash
    Line       User       Host(s)              Idle       Location
*  6 vty 5     root       idle                 00:00:00 10.1.1.1

  Interface    User               Mode         Idle     Peer Address
```

</details>
{: .label .label-green }
