---
layout: default
title: Cisco Switch SSH 설정
parent: Blog
grand_parent: Category
permalink: docs/category/blog/123
child_nav_order: desc
---
# Cisco Switch SSH 설정

<details open markdown="block">
  <summary>
    Table of contents
  </summary>
  {: .no_toc .text-delta .label .label-green }
1. TOC
{:toc}
</details>

---

## 개요

> - Cisco Switch SSH 설정
{: .new }

### SSH 접근 설정

- Enable Password

```bash
switch# configure terminal
switch(config)# enable algorithm-type scrypt secret cisco
switch(config)# do show running-config | include enable
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta }
  
```bash
enable secret 9 $9$MK.hUo10dZ//0Y$63eq6rKJ/3K2DgFRQTIpbzVduZ/Jr813OWhO/5j3yG6
```

</details>
{: .label .label-green }

- Username 생성

```bash
switch(config)# username cisco privilege 15 algorithm-type scrypt secret cisco
switch(config)# do show running-config | include username
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta }
  
```bash
username cisco privilege 15 secret 9 $9$rnEll/AtEUx/k5$NRf6xUYo9EOOL8d4PWF.AZV.aX4Giba6jPv7deW.hzA
```

</details>
{: .label .label-green }

- 기본 AAA 구성

```bash
switch(config)# aaa new-model
switch(config)# aaa authentication login default local
switch(config)# aaa authentication login console none
switch(config)# aaa authorization exec default local
```

- `10.1.1.0 255.255.255.0` ACL 설정

```bash
switch(config)# access-list 10 permit 10.1.1.0 0.0.0.255
switch(config)# access-list 10 permit host 10.1.1.1
```

- SSH 버전 2 구성

```bash
switch(config)# ip ssh version 2
switch(config)# ip ssh time-out 120
```

- Domain 이름 설정

```bash
switch(config)# ip domain-name cisco
```

- RSA 키 생성

```bash
switch(config)# crypto key generate rsa
# 또는
switch(config)# crypto key generate rsa modulus 2048 
```

- VTY 라인 인터페이스 액세스 설정

```bash
switch(config)# line vty 0 15
switch(config-line)# transport input ssh
switch(config-line)# exec-timeout 5 0
switch(config-line)# access-class 10 in
switch(config-line)# exit
```

- SCP 구성

```bash
switch(config)# ip scp server enable
switch(config)# end
switch# write memory
```

- SSH 구성 및 상태에 대한 정보

```bash
switch# show ip ssh
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta }
  
```bash
SSH Enabled - version 2.0
Authentication methods:publickey,keyboard-interactive,password
Encryption Algorithms:aes128-ctr,aes192-ctr,aes256-ctr,aes128-cbc,3des-cbc,aes192-cbc,aes256-cbc
MAC Algorithms:hmac-sha1,hmac-sha1-96
Authentication timeout: 120 secs; Authentication retries: 3
Minimum expected Diffie Hellman key size : 1024 bits
IOS Keys in SECSH format(ssh-rsa, base64 encoded):
ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAAAgQC48RiW3BUP6/Qevsx+LHI5gyn9E1VG14xeP7w8Ecnv
irXvme6rlKOpLa7ei8AkmzEQntFC0qRQzLzDIN8wQXQ2CcL0kg0HYtuB4Dux0UCal5YJpP1rrEffgzaO
ucQfE5ym9mgfGYVRt11mB1aA5fQQDPqOUJO4F4QmDt4wjp5bVQ==
```

</details>
{: .label .label-green }

- SSH 설정 및 상태 정보

```bash
switch# show ssh
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta }
  
```bash
Connection Version Mode Encryption  Hmac         State                 Username
1          2.0     IN   aes128-ctr  hmac-sha1    Session started       cisco
1          2.0     OUT  aes128-ctr  hmac-sha1    Session started       cisco
%No SSHv1 server connections running.
```

</details>
{: .label .label-green }

- 로그인한 사용자 정보

```bash
switch# show users
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta }
  
```bash
    Line       User       Host(s)              Idle       Location
   0 con 0                idle                 00:06:50   
*  2 vty 1     mailplug   idle                 00:00:00 10.1.1.1

  Interface    User               Mode         Idle     Peer Address

```

</details>
{: .label .label-green }
