---
layout: default
title: GNS3 VirtualBox 연동
parent: Blog
grand_parent: Category
permalink: docs/category/blog/83
child_nav_order: desc
---
# systemd-networkd-wait-online.service
{: .no_toc}

## Table of contents
{: .no_toc .text-delta }

1. TOC
{:toc}

---
## 개요

> - GNS3 VirtualBox 연동
> - [GNS3 VM 다운로드](https://www.gns3.com/software/download-vm)
{: .new }

### GNS3 VM 다운로드

![image](https://user-images.githubusercontent.com/36792594/236668744-d9f4bab8-8f59-4fef-b452-5bb34923a784.png)
![image](https://user-images.githubusercontent.com/36792594/236668703-fff7de9f-fc89-4d6e-a735-ffaff2948071.png)
![image](https://user-images.githubusercontent.com/36792594/236668890-44e0757c-ba1e-44cc-abca-c2f95ceacea5.png)

### VirtualBox VT-X/AMD-V 활성화

```bash
VBoxManage.exe modifyvm "GNS3 VM" --nested-hw-virt on
```

![image](https://user-images.githubusercontent.com/36792594/236852254-ee2b6110-0c25-41bc-a40c-57104a336b4b.png)
![image](https://user-images.githubusercontent.com/36792594/236852645-de3394b3-3f03-40ab-ab74-b80aef9499cb.png)

### KVM 활성화 확인

![image](https://user-images.githubusercontent.com/36792594/236854209-e6d474d0-652b-4852-80f8-2485bb16cd03.png)

### /etc/netplan/00-installer-config.yaml

![image](https://user-images.githubusercontent.com/36792594/236676882-225a4699-10b2-4ea8-8bd8-5a069669e348.png)
![image](https://user-images.githubusercontent.com/36792594/236676466-b072e04a-4497-4934-bdef-ad2f914d84ed.png)



```bash
# Cisco IOU 라이센스 생성기 다운로드
wget http://www.ipvanquish.com/download/CiscoIOUKeygen3f.py -O CiscoIOUKeygen3f.py

# Cisco IOU image 라이선스 등록
python3 CiscoIOUKeygen3f.py
```

![image](https://user-images.githubusercontent.com/36792594/236677319-f9f244fa-8af4-4618-8553-3468b292a0a4.png)

### enable 패스워드 설정

```bash
SW1>enable
SW1#configure terminal
SW1(config)#enable secret cisco!@#
SW1(config)#end
```

### ACL 정책 생성

```bash
SW1>enable
SW1#configure terminal
SW1(config)#access-list 1 permit 192.168.56.0 0.0.0.255
SW1(config)#end
```

### SSH 접근 설정

```bash
SW1>enable
SW1#configure terminal
SW1(config)#ip ssh version 2
SW1(config)#ip domain name cisco.com
SW1(config)#crypto key generate rsa general-keys modulus 2048
SW1(config)#line vty 0 15
SW1(config)#transport input ssh
SW1(config)#login local
SW1(config)#end
```

### 관리자 계정 생성

```bash
SW1>enable
SW1#configure terminal
SW1(config)#username cisco privilege 15 secret cisco!@#
SW1(config)#end
```

### Switch 관리 VLAN 포트 설정

```bash
SW1>enable
SW1#configure terminal
SW1(config)#interface vlan 1
SW1(config-if)#ip address 192.168.56.200 255.255.255.0
SW1(config-if)#no shutdown
SW1(config)#end
```

### Switch 관리 VLAN 포트 할당

```bash
SW1>enable
SW1#configure terminal
SW1(config)#interface GigabitEthernet 1/0/1
SW1(config-if)#ip access-group 1 in
SW1(config-if)#no shutdown
SW1(config)#end
```