---
layout: default
title: Cisco Switch Vlan설정
parent: Blog
grand_parent: Category
permalink: docs/category/blog/b0110
child_nav_order: desc
---
# Cisco Switch Vlan설정
<details open markdown="block">
  <summary>
    Table of contents
  </summary>
  {: .no_toc .text-delta .label .label-green }
1. TOC
{:toc}
</details>
---

## 개요

> - Cisco Switch Vlan설정
{: .new }

### Vlan설정

- External Network Vlan
  
```bash
Switch# configure terminal
Switch(config)# vlan 200
Switch(config-vlan)# name Vlan200
Switch(config-vlan)# exit
```

- External Network Vlan Settings

```bash
Switch(config)# interface range GigabitEthernet1/0/1 - 24
Switch(config-if-range)# Switchport mode access
Switch(config-if-range)# Switchport access vlan 200
Switch(config-if-range)# exit
```

- External Network Vlan MGMT Port

```bash
Switch(config)# interface Vlan200
Switch(config-if)# ip address 10.1.1.1 255.255.255.0
Switch(config-if)# no shutdown
Switch(config-if)# exit
Switch(config)# end
Switch# write memory
```

- Internal Network Vlan

```bash
Switch(config)# vlan 100
Switch(config-vlan)# name Vlan100
Switch(config-vlan)# exit
```

- Internal Network Vlan Settings

```bash
Switch(config)# interface range GigabitEthernet1/0/25 - 48
Switch(config-if-range)# Switchport mode access
Switch(config-if-range)# Switchport access vlan 100
Switch(config-if-range)# exit
```

- Internal Network Vlan MGMT Port

```bash
Switch(config)# interface Vlan100
Switch(config-if)# ip address 192.168.1.1 255.255.255.0
Switch(config-if)# no shutdown
Switch(config-if)# exit
Switch(config)# end
Switch# write memory
```

- 기존 trunk 설정에 VLAN 추가

```bash
Switch(config-if)# switchport trunk allowed vlan add 200
```

- 기존 trunk 설정에 VLAN 제거

```bash
Switch(config-if)# switchport trunk allowed vlan remove 200
```

> - Switch A Trunk 정보를 Switch B는 Trunk 정보를 알지 못 하기 때문에 Switch가 2대 이상일 경우 Trunk 사용
> - 이기종간 Vlan 연결시 802.1Q 표준 프로토콜 Trunk 사용
>  
```bash
Switch# configure terminal
Switch(config)# interface GigabitEthernet1/0/47
Switch(config-if)# Switchport mode trunk
Switch(config-if)# Switchport trunk allowed vlan 200
Switch(config)# interface GigabitEthernet1/0/48
Switch(config-if)# Switchport mode trunk
Switch(config-if)# Switchport trunk allowed vlan 100
Switch(config-if)# end
Switch# write memory
```
>
{: .important }
