---
layout: default
title: Cisco Switch FHRP 설정
parent: Blog
grand_parent: Category
permalink: docs/category/blog/b0129
child_nav_order: desc
---

# Cisco Switch FHRP 설정

<details open markdown="block">
  <summary>
    Table of contents
  </summary>
  {: .no_toc .text-delta .label .label-green }
1. TOC
{:toc}
</details>

---

## 개요

> - FHRP(First Hop Redundancy Protocol) 설정
> - HSRP (Hot Standby Router Protocol) Cisco Protocol
> - VRRP (Virtual Router Redundancy Protocol) IETF (Internet Engineering Task Force) Protocol
> - GLBP (Gateway Load Balancing Protocol) Cisco Protocol
{: .new }

### Gateway 이중화 프로토콜

> - 동작 상태 유형
>
| 동작 상태       | 설명                                                         | HSRP             | VRRP                 |
|:-----------------|:--------------------------------------------------------------|:------------------:|:----------------------:|
| Initial         | 프로토콜 시작 시 초기 상태.                                  | -                | -                    |
| Learn           | 라우터가 네트워크 특성을 학습하는 상태 (HSRP에서만 해당).    | -                | -                    |
| Listen          | 가상 라우터를 위해 라우터가 대기하는 상태.                  | -                | -                    |
| Speak           | 가상 라우터의 역할을 수행하는 상태.                        | Active           | Master               |
| Standby         | 대기 중인 상태로, 가상 라우터의 역할에 백업으로 대기.      | Standby          | Backup               |
| Active          | 실제로 패킷을 전달하는 상태.                               | Active           | Master               |
| Speak + Standby | HSRP에서 Active/Standby 모드의 조합.                        | Active/Standby   | Master/Backup        |
| Speak + Active  | HSRP에서 Active/Active 모드의 조합 (VRRP에서는 기본적으로 지원되지 않음). | Active/Active    | Master/Master        |
>
{: .important }

#### VRRP IETF Protocol 설정

```bash
R1# configure terminal
R1(config)# interface vlan 100
R1(config-if)# vrrp 1 ip 10.1.1.1
R1(config-if)# vrrp 1 ip priority 120
R1(config-if)# vrrp 1 preempt
R1(config-if)# vrrp 1 track 10 decrement 30
```

```bash
R2# configure terminal
R2(config)# interface vlan 100
R2(config-if)# vrrp 1 ip 10.1.1.1
R2(config-if)# vrrp 1 preempt
```

```bash
R1# configure terminal
R1(config)# interface vlan 100
R1(config-if)# vrrp 2 ip 10.1.1.2
R1(config-if)# vrrp 2 preempt
```

```bash
R2# configure terminal
R2(config)# interface vlan 100
R2(config-if)# vrrp 2 ip 10.1.1.2
R2(config-if)# vrrp 2 ip priority 120
R2(config-if)# vrrp 2 preempt
R2(config-if)# vrrp 2 track 10 decrement 30
```

#### HSRP Cisco Protocol 설정

```bash
R1# configure terminal
R1(config)# interface vlan 100
R1(config-if)# standby 1 ip 10.1.1.1
R1(config-if)# standby 1 ip priority 120
R1(config-if)# standby 1 preempt
R1(config-if)# standby 1 track Gi1/1 30
```

```bash
R2# configure terminal
R2(config)# interface vlan 100
R2(config-if)# standby 1 ip 10.1.1.1
R2(config-if)# standby 1 preempt
```

```bash
R1# configure terminal
R1(config)# interface vlan 100
R1(config-if)# standby 2 ip 10.1.1.1
R1(config-if)# standby 2 preempt
```

```bash
R2# configure terminal
R2(config)# interface vlan 100
R2(config-if)# standby 2 ip 10.1.1.1
R2(config-if)# standby 2 ip priority 120
R2(config-if)# standby 2 preempt
R2(config-if)# standby 2 track Gi1/1 30
```



```bash
R1# show vrrp all
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta .label .label-green }
  
```bash
nmap --script ssh2-enum-algos 192.168.0.1
```

</details>

```bash
R2# show vrrp all
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta .label .label-green }
  
```bash
nmap --script ssh2-enum-algos 192.168.0.1
```

</details>

```bash
R1# show vrrp brief
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta .label .label-green }
  
```bash
nmap --script ssh2-enum-algos 192.168.0.1
```

</details>

```bash
R2# show vrrp brief
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta .label .label-green }
  
```bash
nmap --script ssh2-enum-algos 192.168.0.1
```

</details>

```bash
R1# show standby all
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta .label .label-green }
  
```bash
nmap --script ssh2-enum-algos 192.168.0.1
```

</details>

```bash
R2# show standby all
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta .label .label-green }
  
```bash
nmap --script ssh2-enum-algos 192.168.0.1
```

</details>

```bash
R1# show standby brief
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta .label .label-green }
  
```bash
nmap --script ssh2-enum-algos 192.168.0.1
```

</details>

```bash
R2# show standby brief
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta .label .label-green }
  
```bash
nmap --script ssh2-enum-algos 192.168.0.1
```

</details>
