---
layout: default
title: Cisco Switch Port-Channel 설정
parent: Blog
grand_parent: Category
permalink: docs/category/blog/b0127
child_nav_order: desc
---

# Cisco Switch Port-Channel 설정

<details open markdown="block">
  <summary>
    Table of contents
  </summary>
  {: .no_toc .text-delta .label .label-green }
1. TOC
{:toc}
</details>

---

## 개요

> - Etherchannel(Port-Channel) 설정
> - Etherchannel 또는 Port-Channel은 LACP는 IEEE 802.3ad 표준에 기반하여 여러 물리적 네트워크 링크를 하나의 논리적 링크로 묶어줌으로써 대역폭을 증가시키고 회복성을 향상시키는 기술
{: .new }

![image](https://github.com/heaths2/heaths2.github.io/assets/36792594/9b6c57a5-c304-400e-9773-3cd954c001ed)

> - UTM Interface Port VLAN 100, 200 DHCP 할당
> - `ip helper-address` 설정 시 Switch에서 trunk로 DHCP정보 받음
> - internal Port 1 DHCP `192.168.100.2 ~ 192.168.100.254` Gateway : 192.168.100.1
```bash
Switch# configure terminal
Switch(config)# interface vlan 100
Switch(config)# ip helper-address 192.168.100.1
```
>
> - internal Port 1 DHCP `172.16.100.2 ~ 172.16.100.254` Gateway : 172.16.100.1
```bash
Switch# configure terminal
Switch(config)# interface vlan 200
Switch(config)# ip helper-address 172.16.100.1
```
>   
{: .important }

### Port-Channel 설정

- Port-Channel 설정 `AC-L2A` 스위치

```bash
Switch# configure terminal
Switch(config)# interface range GigabitEthernet1/0/47 - 48
Switch(config-if-range)# switchport mode trunk
Switch(config-if-range)# switchport trunk allowed vlan 100,200
Switch(config-if-range)# channel-group 10 mode active
Switch(config-if-range)# exit
Switch(config)# interface range GigabitEthernet1/0/45 - 46
Switch(config-if-range)# switchport mode trunk
Switch(config-if-range)# switchport trunk allowed vlan 100,200
Switch(config-if-range)# channel-group 11 mode active
Switch(config-if-range)# exit
Switch(config)# interface range GigabitEthernet1/0/43 - 44
Switch(config-if-range)# switchport mode trunk
Switch(config-if-range)# switchport trunk allowed vlan 100,200
Switch(config-if-range)# channel-group 12 mode active
Switch(config-if-range)# end
```

- Port-Channel 설정 `AC-L2B` 스위치

```bash
Switch# configure terminal
Switch(config)# interface range GigabitEthernet1/0/47 - 48
Switch(config-if-range)# switchport mode trunk
Switch(config-if-range)# switchport trunk allowed vlan 100,200
Switch(config-if-range)# channel-group 11 mode active
Switch(config-if-range)# end
```

- Port-Channel 설정 `AC-L2C` 스위치

```bash
Switch# configure terminal
Switch(config)# interface range GigabitEthernet1/0/47 - 48
Switch(config-if-range)# switchport mode trunk
Switch(config-if-range)# switchport trunk allowed vlan 100,200
Switch(config-if-range)# channel-group 12 mode active
Switch(config-if-range)# end
```

- Port-Channel 설정 정보 확인

```bash
Switch# show running-config | section Port-channel
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta .label .label-green }

```bash
interface Port-channel10
 switchport trunk allowed vlan 100,200
 switchport mode trunk
```

</details>

- 이더채널 또는 포트 채널 정보 조회

```bash
Switch# show etherchannel summary
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta .label .label-green }
  
```bash
Flags:  D - down        P - bundled in port-channel
        I - stand-alone s - suspended
        H - Hot-standby (LACP only)
        R - Layer3      S - Layer2
        U - in use      f - failed to allocate aggregator

        M - not in use, minimum links not met
        u - unsuitable for bundling
        w - waiting to be aggregated
        d - default port


Number of channel-groups in use: 3
Number of aggregators:           3

Group  Port-channel  Protocol    Ports
------+-------------+-----------+-----------------------------------------------
10      Po10(SU)         LACP      Gi1/0/47(P) Gi1/0/48(P)
11      Po11(SU)         LACP      Gi1/0/45(P) Gi1/0/46(P)
12      Po12(SU)         LACP      Gi1/0/43(P) Gi1/0/44(P)
```

</details>

```bash
Switch# show interfaces port-channel 10 etherchannel
```

<details markdown="block">
  <summary>
    코드
  </summary>
  {: .text-delta .label .label-green }

```bash
Port-channel10   (Primary aggregator)

Age of the Port-channel   = 31d:21h:30m:10s
Logical slot/port   = 5/5          Number of ports = 2
HotStandBy port = null
Port state          = Port-channel Ag-Inuse
Protocol            =   LACP
Port security       = Disabled

Ports in the Port-channel:

Index   Load   Port     EC state        No of bits
------+------+------+------------------+-----------
  0     00     Gi1/0/47 Active             0
  0     00     Gi1/0/48 Active             0

Time since last port bundled:    31d:17h:45m:22s    Gi1/0/47
Time since last port Un-bundled: 31d:17h:49m:17s    Gi1/0/48
```

</details>
